[
    {
        "id": "other-project-greenbasket",
        "title": "GreenBasket UI",
        "year": "Sep 2023 - Oct 2023",
        "github": "https://github.com/zainabk1997/uiux",
        "demo":"https://app.moqups.com/AjwBIoBL2zq8mT0pwM5HSIF80nA2C24Y/view/page/ad64222d5",
        "tags": ["Moqups","Figma","Persona Creation","User Flows","Prototyping"],
        "description": "Used Moqups and IBM design thinking concepts to build a grocery retail app prototype with complete user personas, user registration, product selection, add to cart, delivery, payment, and order tracking flows.",
        "image": "/assets/other-projects/greenbasket.png",
        "jpg": "/assets/other-projects/greenbasket.png"

    },
    {
        "id": "other-project-knowmore",
        "title": "Know More, Grow More",
        "year": "Sep 2022 - Dec 2022",
        "github": "https://github.com/zainabk1997/KnowMore_GrowMore",
        "tags": ["Java", "Swing", "DB4O", "Application Design","GitHub"],
        "description": "Developed a CRUD-based application for citywide education management with 4 enterprises, 6 organizations, 4 workflows, & 8 user roles. Based on user roles, users can add, view, update & delete profiles, grades, appointments, meal plans, and dormitories.Also delivered an email verification feature for new students and professors.",
        "image": "/assets/other-projects/knowmore.webp",
        "jpg": "/assets/other-projects/knowmore.webp"

    },
    {
        "id": "featured-project-nesthub",
        "location": "Northeastern University, Boston, MA",
        "title": "NestHub",
        "year": "Sep 2022 - Dec 2022",
        "tags": ["NodeJS", "ExpressJS", "ReactJS", "Rest APIs", "MongoDB","HTML","SCSS","GitHub"],
        "github": "https://github.com/zainabk1997/NestHub",
        "description": "Built a Tinder clone for matching potential roommates using MERN stack and SCSS for UI. Delivered room profile CRUD and preview in ReactJS with API development of the same in Express, user login backend in Express and mongoose, real-time user profile update on tinder swipe, and room profile tinder card UI. ",
        "image": "/assets/other-projects/NestHubProject.png",
        "jpg": "/assets/other-projects/NestHubProject.png"
    },
    {
        "id": "other-project-aging-notifier",
        "title": "Automated Aging Incident Notifier System",
        "year": "Jan 2022 - May 2022",
        "github": "https://github.com/zainabk1997/AgingIRNotifier",
        "tags": ["Google Suite", "Google App Script", "Gmail", "JIRA", "HTML", "CSS"],
        "description": "With the accelerated roll-outs of Atlas for multiple subsdiaries, there was a prime focus on support resources to prioritize tickets and follow-up with users. By leveraging Google Apps Script and Sheets, I was able to extract the user details, JIRA links, incident descriptions and ids, and the SLA deadlines and send a summary every day to every resource so that they could prioritize the closest deadline. This helped in improving resource efficiency and increased follow-ups with Atlas users.",
        "image": "/assets/other-projects/notifier.png",
        "jpg": "/assets/other-projects/notifier.png"
    },
    {
        "id": "other-project-grossprice",
        "title": "Gross Price Mismatch Automation System",
        "year": "Feb 2021 - May 2021",
        "tags": ["Python", "Pandas", "Django MVC", "PostgreSQL","GitHub Actions"],
        "description": "Created a program to resolve global pricing discrepancy by dividing it into two parts to accommodate pricing at the country level and the customer level. Using pandas data frames, I obtained the SKU numbers, prices, validity dates, country codes, and customer ids as an API from SAP ECC and compared it with the same fields in the PostgreSQL pricing table. In case of any differences, the function for generating a new pricelist would be called and the user would be notified about the erroneous SKUs via email.",
        "image": "/assets/other-projects/report.png",
        "jpg": "/assets/other-projects/report.png"
    },
    {
        "id": "other-project-eod",
        "title": "EOD Notifier System",
        "year": "Oct 2019 - Dec 2019",
        "tags": ["Surveying", "User Interviews", "Ideation", "Analysis", "Product Planning"],
        "description": "I noticed that resources in the team were having difficulty prioritizing the End of Day process management due to front-burner tasks related to various projects. Hence, I took up the challenge to implement an email based message notifier with month and week based parameters so that resources could plan any activites around EOD processes in advance. It helped in preventing any major SAP BW versioning issues with Asia, Americas, and Europe and improved on-call efficiency by 25%.",
        "demo": "https://www.zainabkhokawala.com/_files/ugd/0467f0_378223602736465aaf8149cf921f04e5.pdf",
        "image": "/assets/other-projects/eod.png",
        "jpg": "/assets/other-projects/eod.png"
    }
]
